---
kind: property
id: P:Autodesk.Revit.DB.FamilyInstance.CanSplit
zh: 族实例
source: html/a5075af4-0664-ed10-8303-665f0024c30a.htm
---
# Autodesk.Revit.DB.FamilyInstance.CanSplit Property

**中文**: 族实例

Identifies whether a particular family instance can be split at a point on it's defining curve (by Split(Double) ).

## Syntax (C#)
```csharp
public bool CanSplit { get; }
```